#ifndef __STRING_H_
#define __STRING_H_

/*******************************************************************************
 * 函数名称 : TOHEX
 * 函数介绍 : 将val转换成16进制的字符
 * 参数介绍 : val： 将要转换的数据
 * 返回值  :  转换后的字符
 ******************************************************************************/
extern unsigned char TOHEX(char val);

/*******************************************************************************
 * 函数名称 : LongToHexChar
 * 函数介绍 : 将unsigned long转换为16进制的字符串
 * 参数介绍 : val： 将要转换的数据， str:调用者用于接收字符串的空间
 * 返回值  :  无
 ******************************************************************************/
extern void LongToHexChar(unsigned long val, char *str);

#endif
