#ifndef __HEARTMODULE_H_
#define __HEARTMODULE_H_

#include "HC595.h"

#define LED0 17
#define LED1 18
#define LED2 19
#define LED3 20
#define LED4 21
#define LED5 22
#define LED6 23
#define LED7 8
#define LED8 9
#define LED9 10
#define LED10 11
#define LED11 12
#define LED12 13
#define LED13 14
#define LED14 15
#define LED15 0
#define LED16 1
#define LED17 2
#define LED18 3
#define LED19 4
#define LED20 5
#define LED21 6
#define LED22 7

/*******************************************************************************
 * 函数名称 : ANAIMAL_A
 * 函数介绍 : 动画1，顺时针跑马灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void ANAIMAL_A();

/*******************************************************************************
 * 函数名称 : ANAIMAL_B
 * 函数介绍 : 动画2，逆时针跑马灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void ANAIMAL_B();

/*******************************************************************************
 * 函数名称 : ANAIMAL_C
 * 函数介绍 : 动画3，旋风式跑马灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void ANAIMAL_C();

/*******************************************************************************
 * 函数名称 : ANAIMAL_E
 * 函数介绍 : 追赶式跑马灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void ANAIMAL_E();

/*******************************************************************************
 * 函数名称 : delay
 * 函数介绍 : 延時函數
 * 参数介绍 : time  :  時間
 * 返回值  :  无
 ******************************************************************************/
extern void delay(unsigned int time);

#endif
