#ifndef __LED_H_
#define __LED_H_

#include "config.h"

#include "LED.h"

/*******************************************************************************
 * 函数名称 : setLedOn
 * 函数介绍 : 点亮指定小灯
 * 参数介绍 : num  :  要点亮小灯的编号
 * 返回值  :  无
 ******************************************************************************/
extern void setLedOn(unsigned char num);
 
 /*******************************************************************************
 * 函数名称 : setLedOff
 * 函数介绍 : 熄灭指定小灯
 * 参数介绍 : num  :  要熄灭小灯的编号
 * 返回值  :  无
 ******************************************************************************/
extern void setLedOff(unsigned char num);
 
 /*******************************************************************************
 * 函数名称 : setAllLedOn
 * 函数介绍 : 点亮多有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void setAllLedOn();
 
 /*******************************************************************************
 * 函数名称 : setAllLedOff
 * 函数介绍 : 熄灭所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void setAllLedOff();

 /*******************************************************************************
 * 函数名称 : setAllLedToggle
 * 函数介绍 : 反转所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void setAllLedToggle();
 
 /*******************************************************************************
 * 函数名称 : setLedToggle
 * 函数介绍 : 反转指定LED灯
 * 参数介绍 : num : 要反转的LED编号0~7
 * 返回值  :  无
 ******************************************************************************/
extern void setLedToggle(unsigned char num);


 /*******************************************************************************
 * 函数名称 : setAllLed
 * 函数介绍 : set all led status
 * 参数介绍 : allLed : set all Led status value  1:On, 0:OFF
 * 返回值  :  无
 ******************************************************************************/
extern void setAllLed(unsigned char allLed);

 /*******************************************************************************
 * 函数名称 : ledUpdate
 * 函数介绍 : 更新小灯状态
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void ledUpdate();

#endif //__LED_H_

