/*******************************************************************************
 * 文件名称：LED.c
 * 作者    ：  郑朋桥
 * 文件介绍：用于为上层提供统一的LED控制函数.
 * 时间    : 2016/09/09
 ******************************************************************************/
#include "LED.h"

#if ACTIVITY_STATUS
	unsigned char ledstatus = 0xFF;
#else
	unsigned char ledstatus = 0x00;
#endif

/*******************************************************************************
 * 函数名称 : setLedOn
 * 函数介绍 : 点亮指定小灯
 * 参数介绍 : num  :  要点亮小灯的编号
 * 返回值  :  无
 ******************************************************************************/
void setLedOn(unsigned char num)
{
	#if ACTIVITY_STATUS
		ledstatus |= (1 << num);
	#else
		ledstatus &= ~(1 << num);
	#endif
}
 
 /*******************************************************************************
 * 函数名称 : setLedOff
 * 函数介绍 : 熄灭指定小灯
 * 参数介绍 : num  :  要熄灭小灯的编号
 * 返回值  :  无
 ******************************************************************************/
void setLedOff(unsigned char num)
{
	#if ACTIVITY_STATUS
		ledstatus &= ~(1 << num);
	#else
		ledstatus |= (1 << num);
	#endif
}
 
 /*******************************************************************************
 * 函数名称 : setAllLedOn
 * 函数介绍 : 点亮所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void setAllLedOn()
{
	#if ACTIVITY_STATUS
    	ledstatus = 0xFF;
	#else
    	ledstatus = 0x00;
	#endif
}
 
 /*******************************************************************************
 * 函数名称 : setAllLedOff
 * 函数介绍 : 熄灭所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void setAllLedOff()
{
	#if ACTIVITY_STATUS
    	ledstatus = 0x00;
	#else
    	ledstatus = 0xFF;
	#endif
}
 /*******************************************************************************
 * 函数名称 : setAllLedToggle
 * 函数介绍 : 反转所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void setAllLedToggle()
{
	ledstatus = ~LEDDATA;
}
 
 /*******************************************************************************
 * 函数名称 : setLedToggle
 * 函数介绍 : 反转指定LED灯
 * 参数介绍 : num : 要反转的LED编号0~7
 * 返回值  :  无
 ******************************************************************************/
void setLedToggle(unsigned char num)
{
	if( (ledstatus & (1 << num)) )
	{
		ledstatus &= ~(1 << num);
	}
	else
	{
		ledstatus |= (1 << num);
	}
}


 /*******************************************************************************
 * 函数名称 : setAllLed
 * 函数介绍 : set all led status
 * 参数介绍 : allLed : set all Led status value  1:On, 0:OFF
 * 返回值  :  无
 ******************************************************************************/
void setAllLed(unsigned char allLed)
{
	#if ACTIVITY_STATUS
    	ledstatus = allLed;
	#else
    	ledstatus = ~allLed;
	#endif
}


 /*******************************************************************************
 * 函数名称 : ledUpdate
 * 函数介绍 : 更新小灯状态
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void ledUpdate()
{
	LEDDATA = ledstatus;
}
