#ifndef __HC595_H_
#define __HC595_H_
#include "kingst.h"
#include "config.h"

/*******************************************************************************
 * 函数名称 : HC595AddData
 * 函数介绍 : 发送一个595数据
 * 参数介绍 : ch  :  要发送的数据
 * 返回值  :  无
 ******************************************************************************/
extern void HC595AddData(unsigned char SendVal);

/*******************************************************************************
 * 函数名称 : HC595TransformData
 * 函数介绍 : 移位寄存器数据 --> 存储寄存器
 * 参数介绍 : 无 
 * 返回值  :  无
 ******************************************************************************/
extern void HC595TransformData();


#endif
