#include "HC595.h"

#define __nop() __asm NOP __endasm 


/*******************************************************************************
 * 函数名称 : HC595AddData
 * 函数介绍 : 发送一个595数据
 * 参数介绍 : ch  :  要发送的数据
 * 返回值  :  无
 ******************************************************************************/
void HC595AddData(unsigned char SendVal)
{
    unsigned char i;
    for(i=0;i<8;i++)
    {
        if( (SendVal<<i) & 0x80 )
        {
            DS=1;
        }
        else
        {
            DS=0;
        }

        //移位寄存器数据移位
        SHC=0;
        __nop();
        __nop();
        __nop();
        SHC=1;
    }
}


/*******************************************************************************
 * 函数名称 : HC595TransformData
 * 函数介绍 : 移位寄存器数据 --> 存储寄存器
 * 参数介绍 : 无 
 * 返回值  :  无
 ******************************************************************************/
void HC595TransformData()
{
    //移位寄存器数据 --> 存储寄存器
    STC=0;
    __nop();
    __nop();
    __nop();
    STC=1;
}