#ifndef __KEY_H_
#define __KEY_H_

#include "config.h"

/*******************************************************************************
 * 函数名称 : keyScan
 * 函数介绍 : 扫描按键
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void keyScan();


/*******************************************************************************
 * 函数名称 : keyScanReal
 * 函数介绍 : 扫描按键, 实时的反应状态，使用这个函数进行按键扫描的时候，不需要清除事件状态
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void keyScanReal();

/*******************************************************************************
 * 函数名称 : getKeyStatus
 * 函数介绍 : 得到按键状态,每一位代表一个按键状态,1为事件发生,0为无事件
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern unsigned int getKeyStatus();

/*******************************************************************************
 * 函数名称 : clearKeyStatus
 * 函数介绍 : 清楚指定位事件
 * 参数介绍 : which : 将要清楚的事件位
 * 返回值  :  无
 ******************************************************************************/
extern void clearKeyStatus(char which);

#endif

